Tekla Open API Reference for Tekla Structures 2025
Story Methods
The LogicalAreaFilterExpressions.Story type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
LogicalAreaFilterExpressions.Story Class
Tekla.Structures.Filtering.Categories Namespace